app/views/questions/index.html.erb

SELECT "questions".* FROM "questions" ORDER BY created_at DESC
SELECT COUNT(*) FROM "questions"
---
    <div class="span2">
      <p class="pull-right"><%= t('.questions') %> ( <%= @total_questions.count.to_farsi %> )</p>