app/views/questions/show.html.erb

    <p>
      Tags: <% question.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."question_id" = ?  [["question_id", 1]]