app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @answer = Answer.find(params[:id])