app/controllers/questions_controller.rb

  def index
    @questions = Question.paginate(page: params[:page])
---
SELECT "questions".* FROM "questions" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "questions"

  def show
    @answers = @question.answers
    @answer = @question.answers.build
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]

  def edit
    @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]

  def create
    @question = Question.new(question_params)
    @question.user = current_user

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "hi hi hi v hi hi hi hi hi hi hi hi hi "], ["created_at", Sun, 05 May 2013 08:30:04 UTC +00:00], ["title", "First Question"], ["updated_at", Sun, 05 May 2013 08:30:04 UTC +00:00]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "body" = ?, "updated_at" = ? WHERE "questions"."id" = 1  [["body", "This is the first question on question & answer site."], ["updated_at", Mon, 13 May 2013 06:53:11 UTC +00:00]]

    def set_question
      @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]